<template>
  <div id="app">
    <HelloWorld :idioms="idioms"/>
  </div>
</template>

<script>
import HelloWorld from "./components/HelloWorld.vue";

export default {
  name: "app",
  data: function() {
    return {
      idioms: [
        "天行健，君子以自强不息。",
        "苟利国家生死以，岂因祸福避趋之。",
        "勿以恶小而为之，勿以善小而不为。",
        "见善如不及，见不善如探汤。",
        "躬自厚而薄责于人，则远怨矣。",
        "君子成人之美，不成人之恶。小人反是。",
        "见贤思齐焉，见不贤而内自省也。",
        "己所不欲，勿施于人。",
        "当仁，不让于师。",
        "君子欲讷于言而敏于行。",
        "二人同心，其利断金；同心之言，其臭如兰。",
        "君子藏器于身，待时而动。",
        "满招损，谦受益。",
        "言必信，行必果。",
        "毋意，毋必，毋固，毋我。",
        "三人行，必有我师焉，择其善者而从之，其不善者而改之。",
        "君子求诸己，小人求诸人。",
        "君子坦荡荡，小人长戚戚。",
        "不怨天，不尤人。",
        "不迁怒，不贰过。",
        "小不忍，则乱大谋。",
        "小人之过也必文。",
        "过而不改，是谓过矣。",
        "君子务本，本立而道生。",
        "君子耻其言而过其行。",
        "三思而后行。",
        "多行不义必自毙。",
        "人谁无过，过而能改，善莫大焉。",
        "不以一眚掩大德。",
        "人一能之，己百之；人十能之，己千之。",
        "知耻近乎勇。",
        "以五十步笑百步。",
        "君子莫大乎与人为善。",
        "人皆可以为尧舜。",
        "千丈之堤，以蝼蚁之穴溃；百尺之室，以突隙之烟焚。",
        "言之者无罪，闻之者足以戒。",
        "良药苦于口而利于病，忠言逆于耳而利于行。",
        "良言一句三冬暖，恶语伤人六月寒。",
        "千经万典，孝悌为先。",
        "学而不思则罔，思而不学则殆。",
        "知之为知之，不知为不知，是知也。",
        "业精于勤，荒于嬉；行成于思，毁于随。",
        "读书有三到：谓心到，眼到，口到。",
        "学而不厌，诲人不倦。",
        "不积跬步，无以至千里，不积小流，无以成江海。",
        "欲穷千里目，更上一层楼。",
        "强中自有强中手，莫向人前满自夸。",
        "玉不琢，不成器；人不学，不知道。",
        "黑发不知勤学早，白首方悔读书迟。",
        "知不足者好学，耻下问者自满。",
        "学不可以已。",
        "温故而知新，可以为师矣。",
        "读书破万卷，下笔如有神。",
        "少壮不努力，老大徒伤悲。",
        "读书百遍，其义自见。",
        "学而不化，非学也。",
        "好学而不贰。",
        "人而不学，其犹正墙面而立。",
        "知而好问，然后能才。",
        "学之广在于不倦，不倦在于固志。",
        "学而不知道，与不学同；知而不能行，与不知同。",
        "博观而约取，厚积而薄发。",
        "差之毫厘，谬以千里。",
        "盛年不重来，一日难再晨。",
        "言之无文，行而不远。",
        "人之为学，不可自小，又不可自大。",
        "好学近乎知，力行近乎仁，知耻近乎勇。",
        "书到用时方恨少，事非经过不知难。",
        "笨鸟先飞早入林，笨人勤学早成材。",
        "书山有路勤为径，学海无涯苦作舟。",
        "学如逆水行舟，不进则退。",
        "吾生也有涯，而知也无涯。",
        "天下兴亡，匹夫有责。",
        "生于忧患，死于安乐。",
        "位卑未敢忘忧国。",
        "人生自古谁无死，留取丹心照汉青。",
        "先天下之忧而忧，后天下之乐而乐。",
        "小来思报国，不是爱封侯。",
        "有益国家之事虽死弗避。",
        "一寸山河一寸金。",
        "欲安其家，必先安于国。",
        "捐躯赴国难，视死忽如归。",
        "风声、雨声、读书声，声声入耳；家事、国事、天下事，事事关心。",
        "生当作人杰，死亦为鬼雄。",
        "利于国者爱之，害于国者恶之。",
        "读书本意在元元。",
        "时穷节乃现，一一垂丹青。",
        "哀哀父母，生我劬劳。",
        "报国之心，死而后已。",
        "忧国忘家，捐躯济难，忠臣之志也。",
        "君子之交淡如水，小人之交甘若醴。",
        "老吾老，以及人之老；幼吾幼，以及人之幼。",
        "见侮而不斗，辱也。",
        "天下皆知取之为取，而莫知与之为取。",
        "人固有一死，或重于泰山，或轻于鸿毛。",
        "羊有跪乳之恩，鸦有反哺之义。"
      ]
    };
  },
  components: {
    HelloWorld
  }
};
</script>

<style>
</style>
